def is_square(a, b):
    """
    Проверяет, равны ли стороны прямоугольника.
    Возвращает True при равных сторонах, иначе False.

    Пример вызова:
        is_square(3, 3)
    """
    return a == b


def area(a, b):
    """
    Вычисляет площадь прямоугольника со сторонами a и b.

    Пример вызова:
        area(3, 4)
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника со сторонами a и b.

    Пример вызова:
        perimeter(3, 4)
    """
    return 2 * a + 2 * b


def diagonal(a, b):
    """
    Вычисляет длину диагонали прямоугольника
    со сторонами a и b.

    Пример вызова:
        diagonal(3, 4)
    """
    return (a ** 2 + b ** 2) ** 0.5
